CONTRIBUTING.md

# Table of Contents

1.  [Determine Full Contributing Guidelines](#org5048ebd)
2.  [Style](#org2ac119a)
    1.  [LaTeX](#org164b7a1)
    2.  [References](#org73e276f)
3.  [Translation (Needed)](#org3dfc0b8)
4.  [Copyright and Licensing](#org899c043)



<a id="org5048ebd"></a>

# TODO Determine Full Contributing Guidelines


<a id="org2ac119a"></a>

# Style


<a id="org164b7a1"></a>

## LaTeX

-   As a standard format for academic papers, we will use: TBD


<a id="org73e276f"></a>

## References


<a id="org3dfc0b8"></a>

# Translation (Needed)

I am looking to translate this entire repo into different languages. Please contact me if you would like to help in this effort!


<a id="org899c043"></a>

# Copyright and Licensing

-   Whenever you create a new file, please follow the [REUSE specification, version 3.0.](https://reuse.software/spec/) In particular, at the top of the file, you should add a SPDX-FileCopyRightText and SDPX-License-Identifier in comments.
-   If you are *changing* or *adding* to a file, add your own SPDX-FileCopyRightText tag below prexisting ones (*but* above SPDX-License-Identifier). In case you would like to use a different license for a section YOU create, **you must add comments between your contributions, with the SPDX-FileCopyRightText and SPDX-License-Identifier tags**
-   You may apply a license that is compatible with and provides all of the rights of CC-BY-4.0. If you add a new license, be sure to add it under LICENSES or raise an issue.

